# 1. დაწერეთ პითონის პროგრამა, რომელიც დასაწყისში შექმნის ცარიელ სიას ([]), 
# თუ მომხარებელი შეიყვანს სიმბოლო 'a'-ს, ნიშნავს რომ უნდა დაამატოთ სიაში რიცხვი; 
# თუ აკრიფა 'r', სიიდან უნა წაიშალოს რიცხვი; 'e'-ს შეტანისას პროგრამამ უნდა დაასრულოს მუშაობა. 
# მიღებული შედეგი დაბეჭდეთ კონსოლში.
# a – append
# r – remove
# e – exit
# გამოიყენეთ მხოლოდ ეს ბრძანებები და მოახდინეთ სიაზე ზემოქმედება.

my_list = []

while True:
    user = input("თუ გსურთ სიაში რიცხვის დამატება აკრიფეთ ბრძანება a, თუ გსურთ სიიდან რიცხვის წაშლა შეიყვანეთ ბრძანება r, ხოლო თუ გსურთ დასრულება შეიყვანეთ ბრძანება e:")
    if user == "a":
        number = int(input("შეიყვანეთ რიცხვი:"))
        my_list.append(number)
        print("სიაში დაემატა რიცხვი:",number)
        print("მიმდინარე სია არის:",my_list)
    elif user == "r":
        number = int(input("შეიყვანეთ რიცხვი:"))
        if number in my_list:
           my_list.remove(number)
           print("სიიდან წაიშალა რიცხვი:",number)
           print("მიმდინარე სია არის:",my_list)
        else:
           print("ასეთი რიცხვი არ არის სიაში.")
    elif user == "e":
        print("დასრულდა პროგრამა, თქვენ მიერ შედგენილი სია:", my_list)
        break
    else:
        print("შეიყვანეთ მხოლოდ მოცემული ბრძანებები.")
    


# 2. დაწერეთ პითონის პროგრამა, რომელიც შექმნის სიას my_list_1 = [43, '22', 12, 66, 210, ["hi"]], 
# და შეასრულებს შემდეგ ნაბიჯებს:

my_list_1 = [43, '22', 12, 66, 210, ["hi"]]

# a. დაბეჭდავს 210-ის ინდექსს; 
index = my_list_1.index(210)
print("210 რიცხვის ინდექსია:", index)

# b. დაამატებს ბოლო ელემენტში ტექსტს "hello";
add = my_list_1[-1].append("hello")
print("ახალი სია:", my_list_1)

# c. წაშლის მეორე ინდექსზე მდგომ ელემენტს და დაბეჭდავს სიას;
del my_list_1[2]
print("ახალი სია:", my_list_1)

# d. შექმენით ახალი სია my_llist_2, რომელსაც ექნება my_llist_1-ის მნიშვნელობა, 
# გაასუფთავეთ my_llist_2-ის მნიშნველობა და დაბეჭდეთ ორივე სია.
# მინიშნება: სიის გასუფთავება – arr.clear()
my_list_2=my_list_1.copy()
my_list_2.clear()
print("List 2:", my_list_2, id(my_list_2))
print("List 1:", my_list_1, id(my_list_1))


# 3. დაწერეთ პითნის პროგრამა, რომელიც მიიღებს ტელეფონის ნომერს და regex-ით შეამოწმებს შეყვანილი 
# ნომერი იცავს თუ არა "(123) 456-789" ფორმატს, თუ იცავს დააბრუნეთ შეყნვაილი ტელეფონის ნომერი, 
# წინააღმდეგ შემთხვევაში გამოიტანეთ "Invalid format" ტექსტი.
# მინიშნება: სრული დამთხვევისთვის გამოიყენეთ .fullmatch() მეთოდი re მოდულიდან.

import re

num = input("შეიყვანეთ ტელეფონის ნომერი შემდეგი ფორმატით (123) 456-789: ")
pattern = r"\(\d{3}\) \d{3}\-\d{3}"

if re.fullmatch(pattern,num):
    print("შეყვანილი ნომერია:",num )
else:
    print("Invalid format") 