# 1. დაწერეთ პითონის ფუნქცია, რომელიც მიიღებს პარამეტრად n, და გამოიტანს ფიბონაჩის n რაოდენობის 
# მიმდევრობას.
def outer(N):
    a,b , arr= 0,1,[]

    def fibo():
        nonlocal a,b

        for _ in range(N):
            arr.append(a)

            a,b = b, a + b
        return arr
    return fibo()

# ==========================================
num = int(input("შეიყვანეთ რიცხვი: "))
print(f"{num} რაოდენობის ფიბონაჩის მიმდევრობა არის: {outer(num)}")


# 2. დაწერეთ პითონის ფუნქცია, რომელიც მიიღებს პარამეტრად ორ სტრიქონს და შეამოწმებს არის თუ არა 
# სტრიქონები ანაგრამები (ანაგრამი არის სიტყვა ან შესიტყვება, რომელიც წარმოიქმნება სხვა სიტყვის ან 
# შესიტყვების ასოების გადაადგილებით). მაგ.: race და care ანაგრამებია.

def anagrams(str1, str2):
    return sorted(str1) == sorted(str2)

# ==========================================
anagram1= input("შეიყვანეთ პირველი პარამეტრი: ")
anagram2= input("შეიყვანეთ პირველი პარამეტრი: ")
if anagrams(anagram1, anagram2):
    print(f'"{anagram1}" და "{anagram2}" არის ანაგრამები.')
else:
    print(f'"{anagram1}" და "{anagram2}" არ არის ანაგრამები.')


# 3. დაწერეთ პითონის ფუნქცია რომელიც მიიღებს n რიცხვს და დააბრუნებს მის ფაქტორიალს.

def factorial(n):
    if n == 0 or n == 1:
        return 1
    else:
        return n * factorial(n - 1) 
    
# ==========================================    
number = int(input("შეიყვანეთ რიცხვი: "))
print(f"{number}-ის ფაქტორიალი არის: {factorial(number)}")

# 4. დაწერეთ პითნის ფუნქცია რომელიც მიიღებს  ორ პარამეტრს, პირველს სტრიქონს და მეორეს სიმბოლოს. 
# ფუნქციამ უნდა მოძებნოს სტრიქონში რამდენჯერ მეორდება პარამეტრად მიღებული სიმბოლო და დააბრუნოს  
# მისი რაოდენობა.

def count_character(string, simbol):
    return string.count(simbol)

# ==========================================
input_string = input("შეიყვანეთ სტრიქონი: ")
input_simbol = input("შეიყვანეთ სიმბოლო: ")
print(f'სიმბოლო "{input_simbol}" მეორდება სტრიქონში {count_character(input_string, input_simbol)}-ჯერ.')

