# დავალება 1. დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მომხმარებლისგან რიცხვს "n" და ბეჭდავს 
# 1-დან "n"-მდე რიცხვების ჯამს.

# number=int(input("შეიყვანეთ რიცხვი:"))

# s=0
# for i in range(1,number+1):
#     s+=i
# print('1 დან თქვენ შეყვანილ მონაცემამდე რიცხვების ჯამია:',s)

# დავალება 2. დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მომხმარებლისგან რიცხვს და შემდეგ იყენებს "while" 
# ციკლს რომ რევესრულად დაბეჭდოს რიცხვები 0-მდე. მაგალითად თუ შეიყვანს 4, დაიბეჭდოს 4, 3, 2, 1

# ვარიანტი 1

# number=int(input("შეიყვანეთ რიცხვი:"))

# while True:
#     if number<1:
#         break
#     print(number)

#     number-=1

# ვარიანტი 2

# import time

# number=int(input("შეიყვანეთ რიცხვი:"))

# while number>0:
#     print(number)

#     time.sleep(0.25)
#     number-=1


# დავალება 3. დაწერეთ პითონის პროგრამა თამაშისთვის, რომელიც მუდმივად სთხოვს მომხმარებელს გამოიცნოს 
# წინასწარ განსაზღვრული რიცხვი. როდესაც მომხმარებელი გამოიცნობს სწორ რიცხვს, 
# დაასრულებს პროგრამა მუშაობას.

# from random import randint

# number=randint(1,100)
# i=1

# print('გამოიცანით რიცხვი 1 დან 100 ის ჩათვლით.',"\n")
# guess=0

# while guess != number:
#     guess=int(eval(input(f"ნაბიჯი N{i}. შეიყვანეთ რიცხვი:")))

#     if guess>number:
#         print('მაღალია')
#     elif guess<number:
#         print('დაბალია')

#     i+=1
# else:
#     print(f"თქვენ გამოიცანით რიცხვი, ის იყო {number}.")

# print('თამაში დასრულებულია')


# დავალება 4. დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მუდმივად რიცხვებს. შექმენით საწყისი ცვლადი 
# total_sum = 0, შეამოწმეთ რიცხვი თუ დადებითია, მხოლოდ მაშინ დაუმატეთ total_sum ცვლადს. 
# ეს პროცესი გაგრძელდეს იქამდე სანამ მომხმარებელი არ შეიყვანს 'sum' ტექსტს, რის შემდეგაც დაიბეჭდება 
# შეყვანილი დადებითი რიცხვების ჯამი.

# i=1
# total_sum = 0

# print('შეიყვანეთ რიცხვები. ჯამის მისაღებად კი შეიყვანეთ ტექსტი sum',"\n")

# while True:
#     N=input(f"რიცხვი N{i}:")
#     if N == 'sum':
#         print('წინა შეყვანილი რიცხვების ჯამია:',total_sum)
#         break
#     elif float(N) > 0:
#         total_sum+=float(N) 
#     i+=1







