# დავალება 1. კონსოლიდან შეიტანეთ ორი რიცხვი და დაბეჭდეთ ყველა არითმეტიკული ოპერაცია 
# (მიმატება, გამოკლება, გამრავლება, ჩვეულებრივი გაყოფა, მთელზე გაყოფა, ნაშთის აღება, ახარისხება).

# ვარიანტი 1  
# num1=eval(input('შეიყვანეთ პირველი რიცხვი: '))
# num2=eval(input('შეიყვანეთ მეორე რიცხვი: '))
# print(num1)
# print(num2,"\n")

# print('მიმატება:', num1+num2)
# print('გამოკლება:',num1-num2)
# print('გამრავლება:',num1*num2)
# print('ჩვეულებრივი გაყოფა:',num1/num2)
# print('მთელზე გაყოფა:',num1//num2)
# print('ნაშთის აღება:',num1%num2)
# print('ახარისხება:',num1**num2)

# ვარიანტი 2
# num1=eval(input('შეიყვანეთ პირველი რიცხვი: '))
# num2=eval(input('შეიყვანეთ მეორე რიცხვი: '))
# print(num1)
# print(num2,"\n")

# print(f"{num1}+{num2}= {num1+num2}")
# print(f"{num1}-{num2}= {num1-num2}")
# print(f"{num1}*{num2}= {num1*num2}")
# print(f"{num1}/{num2}= {num1/num2}")
# print(f"{num1}//{num2}= {num1//num2}")
# print(f"{num1}%{num2}= {num1%num2}")
# print(f"{num1}**{num2}= {num1**num2}")


# დავალება 2. დაწერეთ პროგრამა რომბის ფართობის გამოსათვლელად. 
# მომხმარებელს კლავიატურის გამოყენებით შეაქვს ორი დიაგონალის სიგრძე.

# D1=eval(input('შეიყვანეთ პირველი დიაგონალის სიგრძე: '))
# D2=eval(input('შეიყვანეთ მეორე დიაგონალის სიგრძე: '))
# print("D1 =", D1)
# print("D2 =", D2,"\n")
# print('რომბის ფართობი არის (D1*D2)/2=', (D1*D2)/2, sep="")


# დავალება 3. მომხმარებელის შეაქვს მეტრების რაოდენობა. 
# დაბეჭდეთ შესაბამისი მნიშვნელობა სანტიმეტრებში, დეციმეტრებში, მილიმეტრებში, მილში.

# metre=eval(input('შეიყვანეთ რიცხვი მეტრებში: '))
# print('სანტიმეტრებში:', metre*100)
# print('დეციმეტრებში:',metre*10)
# print('მილიმეტრებში:', metre*1000)
# print('მილში:', metre*0.0006213712)


# დავალება 4. დაწერეთ პროგრამა, რომელიც ითვლის სამკუთხედის ფართობს. 
# მომხმარებელს კონსოლიდან შეყავს სამკუთხედის სიმაღლისა და ფუძის მნიშვნელობა.

# Height=eval(input('შეიყვანეთ სამკუთხედის სიმაღლის მნიშვნელობა: '))
# b=eval(input('შეიყვანეთ სამკუთხედის ფუძის მნიშვნელობა: '))
# print('სამკუთხედის ფართობია:', (b*Height)/2)


# დავალება 5. კონსოლიდან შეიტანეთ ორნიშნა რიცხვი და დაბეჭდეთ ციფრთა ჯამი.

# ვარიანტი 1  
# number=input('შეიყვანეთ ორნიშნა რიცხვი: ')
# print('შეყვანილი რიცხვის ციფრთა ჯამია:',int(number[0])+int(number[1]))

# ვარიანტი 2 
# number=input('შეიყვანეთ ორნიშნა რიცხვი: ')
# if len(number)==2:
#     print('შეყვანილი რიცხვის ციფრთა ჯამია:',int(number[0])+int(number[1]))
# else:
#     print("შეცდომა: გთხოვთ შეიყვანოთ მხოლოდ ორნიშნა რიცხვი (10-დან 99-მდე).")